default_model_filename: "irra_cuhk_image_encoder.plan"
name: "irra_cuhk_image_encoder"
platform: "tensorrt_plan"
max_batch_size: 32
input [
  {
    name: "image"
    data_type: TYPE_FP16
    dims: [ 3, 384, 128 ]
  }
]
output [
  {
    name: "image_embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
